In [6]:

import pandas as pd
import numpy as np

In [60]:
alumn_column = ["ID_ALUNO", "TP_SITUACAO", "TP_MODALIDADE_ENSINO"]
Talunos = pd.read_csv(r"/content/drive/MyDrive/Curated/Aluno.csv", index_col=False, header=0, usecols=alumn_column)

In [59]:
valid_situation = [2,3]
alunos = Talunos[Talunos['TP_SITUACAO'].isin(valid_situation)]


# **Pergunta 8**

**Para responder essa pergunta, realizamos uma contagem dos alunos que repetiam, com a ressalva de que eles deveriam estar ou cursando ou com a matrícula trancada.**

In [62]:
alunos['ID_ALUNO'].value_counts().head(10)

1B4E3661691EF57DC103A876D7AFE0E6    13
1E9323CB6AD381FCB7B376684848D486    13
0CE5BBE212117B15F493A59DE6E0BE29    12
4C916F373F3A26E55F76DEBF99D5ECF7    12
ED06F8483F3C984E68001C24974C64F7    10
9D5B68E79A65729829D81A994FDD4CA2    10
38A4A247395BF1C79DCB0FAB5CF22234    10
F1DFEDD900C413053B1E2A8512CCC695     9
DB564BFCF9E8A24C1836C62B251880C8     9
02F5E439A146D2B122225AC0EE862A42     8
Name: ID_ALUNO, dtype: int64

**Podemos ver que temos alguns alunos matriculados em até 13 locias/cursos diferentes, então investigamos e vimos que esses alunos estão com 13 matrículas em cursos a distância.**

In [75]:
alunos[alunos['ID_ALUNO'] == "1E9323CB6AD381FCB7B376684848D486"]

         TP_MODALIDADE_ENSINO                          ID_ALUNO  TP_SITUACAO
2382306                     2  1E9323CB6AD381FCB7B376684848D486            2
6233034                     2  1E9323CB6AD381FCB7B376684848D486            2
6236555                     2  1E9323CB6AD381FCB7B376684848D486            2
6281873                     2  1E9323CB6AD381FCB7B376684848D486            2
6282623                     2  1E9323CB6AD381FCB7B376684848D486            2
6283457                     2  1E9323CB6AD381FCB7B376684848D486            2
6283804                     2  1E9323CB6AD381FCB7B376684848D486            2
6284005                     2  1E9323CB6AD381FCB7B376684848D486            2
6295249                     2  1E9323CB6AD381FCB7B376684848D486            2
6295691                     2  1E9323CB6AD381FCB7B376684848D486            2
6295929                     2  1E9323CB6AD381FCB7B376684848D486            2
6296662                     2  1E9323CB6AD381FCB7B376684848D486            2
6297077                     2  1E9323CB6AD381FCB7B376684848D486            2

In [76]:
alunos[alunos['ID_ALUNO'] == "1B4E3661691EF57DC103A876D7AFE0E6"]

         TP_MODALIDADE_ENSINO                          ID_ALUNO  TP_SITUACAO
502796                      2  1B4E3661691EF57DC103A876D7AFE0E6            2
530174                      2  1B4E3661691EF57DC103A876D7AFE0E6            2
2739475                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
2745261                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
2747674                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6253586                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6263335                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6287353                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6289632                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6291131                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6292258                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
6294136                     2  1B4E3661691EF57DC103A876D7AFE0E6            2
7463100                     2  1B4E3661691EF57DC103A876D7AFE0E6            3

**Por fim, iremos olhar quantos alunos aparecem 2 ou mais vezes na base de dados. Esse valor estará indicado como True na função abaixo.**

In [77]:
alunos['ID_ALUNO'].duplicated().value_counts()

False    5838713
True      316909
Name: ID_ALUNO, dtype: int64